---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkOptions.#ctor(Autodesk.Revit.DB.RevitLinkOptions)
source: html/ad030ec8-39ae-6288-79e5-ca88e94ae0e4.htm
---
# Autodesk.Revit.DB.RevitLinkOptions.#ctor Method

Constructs a new copy of the input RevitLinkOptions object.

## Syntax (C#)
```csharp
public RevitLinkOptions(
	RevitLinkOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.RevitLinkOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null